<?php

get_header(); ?>
<main class="main" id="thankyou">
  <section class="sec-0 relative">
    <div class="sec-0__container container">
      <div class="sec-0__layout">
        <img class="sec-0__content-img" src="<?php echo get_template_directory_uri(); ?>/assets/images/sec-0-bg.webp" alt="">
        <div class="sec-0__content relative">
          <h1 class="sec-0__title _main-title">
            Все прошло <br> успешно!
          </h1>
          <p class="sec-0__guarant">
            Для более полной оценки объема работ <br>
            специалисту <b>необходимо задать вам <br>
              несколько уточняющих вопросов</b>
          </p>
          <div class="front-block-2__info">
            <svg width="24" height="33" viewBox="0 0 24 33" fill="none" xmlns="http://www.w3.org/2000/svg">
              <g clip-path="url(#clip0_1_573)">
                <path fill-rule="evenodd" clip-rule="evenodd"
                  d="M11.3634 24.9881C12.0934 24.9931 12.6404 25.5381 12.6364 26.2401C12.6324 26.9401 12.0844 27.4721 11.3494 27.4811C10.9444 27.4851 10.5394 27.4821 10.1344 27.4821C9.71938 27.4811 9.30338 27.4881 8.88938 27.4801C8.18338 27.4641 7.64338 26.9141 7.64738 26.2251C7.65038 25.5381 8.19238 24.9951 8.90338 24.9881C9.72338 24.9801 10.5434 24.9811 11.3634 24.9881ZM10.1344 8.01505C9.71938 8.01505 9.30338 8.02205 8.88938 8.01405C8.18338 7.99905 7.64338 7.44905 7.64738 6.76005C7.65038 6.07205 8.19238 5.53005 8.90338 5.52105C9.72338 5.51405 10.5434 5.51605 11.3634 5.52105C12.0934 5.52705 12.6404 6.07205 12.6364 6.77605C12.6324 7.47405 12.0844 8.00605 11.3484 8.01505C10.9444 8.01905 10.5394 8.01605 10.1344 8.01505ZM13.0274 16.1231C12.5624 16.6141 12.0764 17.0831 11.5984 17.5601C10.8564 18.3031 10.1164 19.0461 9.37238 19.7861C8.75138 20.4021 8.04138 20.4051 7.42738 19.7941C6.62438 18.9951 5.82038 18.1971 5.02738 17.3901C4.62938 16.9841 4.54638 16.4671 4.76738 15.9831C4.98238 15.5141 5.45738 15.2251 5.97138 15.2561C6.32038 15.2781 6.60338 15.4351 6.84638 15.6791C7.35038 16.1901 7.85838 16.6951 8.39438 17.2331C9.18638 16.4401 9.94938 15.6771 10.7114 14.9141C10.8954 14.7291 11.0744 14.5421 11.2644 14.3651C11.7814 13.8861 12.5194 13.8871 13.0074 14.3601C13.5024 14.8411 13.5214 15.6021 13.0274 16.1231ZM22.5644 22.7381C20.0994 22.7421 17.6354 22.7421 15.1714 22.7381C14.4234 22.7371 13.8874 22.2071 13.8884 21.4631C13.8904 20.6121 13.8074 19.7541 14.0664 18.9231C14.6994 16.9001 16.0584 15.6941 18.1434 15.3101C18.2014 15.3001 18.2584 15.2831 18.3434 15.2621C17.9564 15.1261 17.5844 15.0381 17.2544 14.8691C15.8614 14.1541 15.1164 12.9991 15.1464 11.4331C15.1764 9.87805 15.9674 8.76605 17.3644 8.09505C17.5634 7.99905 17.6384 7.90905 17.6344 7.68805C17.6194 6.98205 17.6334 6.27305 17.6284 5.56805C17.6164 4.10905 16.5384 3.02905 15.0774 3.02705C11.7814 3.02105 8.48538 3.02105 5.18938 3.02705C3.74838 3.03005 2.65838 4.11505 2.65738 5.55205C2.65238 12.8531 2.65238 20.1501 2.65738 27.4491C2.65838 28.8861 3.74938 29.9721 5.19038 29.9761C8.49638 29.9811 11.8024 29.9821 15.1094 29.9751C16.5304 29.9721 17.6094 28.8841 17.6284 27.4631C17.6324 27.1221 17.6204 26.7781 17.6324 26.4351C17.6564 25.7881 18.1694 25.2721 18.8054 25.2371C19.4574 25.2041 20.0674 25.6731 20.1064 26.3261C20.1594 27.2361 20.1934 28.1581 19.8724 29.0391C19.1834 30.9291 17.8504 32.0601 15.8674 32.4161C15.8084 32.4271 15.7524 32.4541 15.6944 32.4721C11.9924 32.4721 8.29138 32.4721 4.58838 32.4721C4.53238 32.4541 4.47638 32.4251 4.41738 32.4161C1.99738 32.0571 0.16638 29.9821 0.16338 27.5401C0.15338 20.1811 0.15438 12.8211 0.16338 5.46005C0.16538 3.19705 1.76038 1.20805 3.95738 0.672053C4.16638 0.619053 4.37838 0.577053 4.58838 0.529053C8.29138 0.529053 11.9924 0.529053 15.6944 0.529053C16.1704 0.667053 16.6724 0.748053 17.1154 0.954053C19.0504 1.85305 20.0534 3.39005 20.1204 5.52205C20.1444 6.25905 20.1284 6.99905 20.1214 7.73805C20.1194 7.89905 20.1554 7.99105 20.3204 8.06505C21.8714 8.76105 22.7734 10.2661 22.6074 11.8571C22.4324 13.5381 21.2464 14.8291 19.5424 15.1921C19.5064 15.2001 19.4704 15.2121 19.3394 15.2501C19.5984 15.3021 19.7664 15.3341 19.9324 15.3701C22.1944 15.8531 23.8384 17.8591 23.8664 20.1681C23.8714 20.5971 23.8714 21.0221 23.8664 21.4491C23.8574 22.2131 23.3334 22.7381 22.5644 22.7381ZM20.1234 11.5141C20.1254 10.8271 19.5664 10.2651 18.8804 10.2631C18.1954 10.2611 17.6324 10.8201 17.6304 11.5051C17.6284 12.1901 18.1874 12.7541 18.8724 12.7571C19.5574 12.7581 20.1214 12.1971 20.1234 11.5141ZM18.6714 17.7561C17.3854 17.8591 16.2414 19.1131 16.4234 20.2331C18.0594 20.2331 19.6984 20.2331 21.3594 20.2331C21.3794 18.7971 20.1084 17.6411 18.6714 17.7561Z"
                  fill="#F37021" />
              </g>
              <defs>
                <clipPath id="clip0_1_573">
                  <rect width="24" height="33" fill="white" />
                </clipPath>
              </defs>
            </svg>

            <p class="front-block-2__info-text">
              Пожалуйста, проверьте корректность<br>
              введенного вами номера телефона
            </p>
          </div>
          <div class="front-block-2__bottom">
            <p class="_input front-block-2__number">
              +7 999 610 77 89
            </p>
            <a class="front-block-2__btn _main-btn" href="#change-number" data-fancybox>
              Нашел ошибку в номере,<br>
              хочу ввести корректный
            </a>
          </div>
        </div>
        <a data-fancybox href="<?php echo get_template_directory_uri(); ?>/assets/images/thanks-woman.webp" class="sec-0__image _image-abs">
          <img class="_img" src="<?php echo get_template_directory_uri(); ?>/assets/images/thanks-woman.webp"
            alt=" Изображение - Оклейка автомобилей полиуретановой пленкой">

          </video>
        </a>
      </div>
    </div>
  </section>
  <section class="section-21">
    <div class="section-21__container">
      <h2 class="section-21__title _title">
        Не хотите ждать или есть срочный вопрос?
      </h2>
      <h3 class="section-21__subtitle _subtitle">
        Задайте ваши вопросы специалисту прямо сейчас <br>
        по телефону или написать в мессенджер
      </h3>
      <div class="section-21__items">
        <a class="section-21__phone" href="tel:+74952980377">
          <svg width="18" height="28" viewBox="0 0 18 28" fill="none" xmlns="http://www.w3.org/2000/svg">
            <g clip-path="url(#clip0_90_2449)">
              <path
                d="M12.709 27.9863H4.97596C4.9275 27.9727 4.87212 27.9454 4.82365 27.9385C2.09596 27.5834 0.0121154 25.3024 0.00519231 22.598C-0.00173077 16.8615 -0.00173077 11.1249 0.00519231 5.38829C0.0121154 3.10732 1.52135 1.05171 3.70212 0.320976C4.1175 0.18439 4.55365 0.109268 4.97596 0C7.55135 0 10.1337 0 12.709 0C12.7575 0.0136585 12.8129 0.0409756 12.8613 0.0478049C15.1529 0.348293 16.9875 1.98049 17.5275 4.20683C17.5829 4.44585 17.6313 4.68488 17.6798 4.91707V23.0624C17.666 23.1102 17.6383 23.1649 17.6313 23.2127C17.299 25.3229 16.129 26.798 14.1352 27.6039C13.6852 27.7883 13.1867 27.8566 12.709 27.9795V27.9863ZM15.4713 14.0205C15.4713 11.2068 15.4713 8.39317 15.4713 5.57951C15.4713 3.61268 14.0313 2.18537 12.0375 2.18537C9.91211 2.18537 7.78673 2.18537 5.66135 2.18537C3.65365 2.18537 2.21365 3.60585 2.21365 5.58634C2.21365 11.1863 2.21365 16.7863 2.21365 22.3932C2.21365 24.3805 3.65365 25.801 5.65442 25.801C7.77288 25.801 9.89135 25.801 12.0029 25.801C14.0313 25.801 15.4644 24.3873 15.4644 22.3863C15.4644 19.6 15.4644 16.8137 15.4644 14.0273L15.4713 14.0205Z"
                fill="#F37021" />
              <path
                d="M8.85519 4.37134C9.21519 4.37134 9.57519 4.37134 9.92827 4.37134C10.5721 4.37817 11.0567 4.85622 11.0498 5.47768C11.0498 6.07866 10.5652 6.54987 9.93519 6.5567C9.20827 6.56353 8.48135 6.56353 7.75442 6.5567C7.11058 6.5567 6.62596 6.065 6.63289 5.45036C6.63289 4.84939 7.1175 4.37817 7.7475 4.37134C8.11442 4.37134 8.48135 4.37134 8.84827 4.37134H8.85519Z"
                fill="#F37021" />
              <path
                d="M8.8482 23.6159C8.4882 23.6159 8.1282 23.6159 7.77512 23.6159C7.12435 23.6091 6.63974 23.1447 6.63281 22.53C6.63281 21.9154 7.11743 21.4374 7.76127 21.4305C8.4882 21.4305 9.21512 21.4237 9.94204 21.4305C10.572 21.4305 11.0497 21.9086 11.0567 22.5164C11.0567 23.1174 10.579 23.6022 9.95589 23.6159C9.58897 23.6227 9.22204 23.6159 8.85512 23.6159H8.8482Z"
                fill="#F37021" />
            </g>
            <defs>
              <clipPath id="clip0_90_2449">
                <rect width="18" height="28" fill="white" />
              </clipPath>
            </defs>
          </svg>
          +7 495 298 03 77
        </a>
        <div class="section-21__socials socials">
          <a href="https://wa.me/74952980377" target="_blank" class="socials__button socials__button_wh">Написать в
            WhatsApp
            <svg width="22.000000" height="22.000000" viewBox="0 0 22 22" fill="none"
              xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink">
              <desc>
                Created with Pixso.
              </desc>
              <defs>
                <clipPath id="clip109_56">
                  <rect id="_Слой_1" width="22.000000" height="22.000000" fill="white" fill-opacity="0" />
                </clipPath>
              </defs>
              <rect id="_Слой_1" width="22.000000" height="22.000000" fill="#FFFFFF" fill-opacity="0" />
              <g clip-path="url(#clip109_56)">
                <path id="Vector"
                  d="M18.37 3.14C16.35 1.11 13.66 0 10.79 0C4.89 0 0.09 4.8 0.09 10.7C0.09 12.59 0.58 14.43 1.51 16.06L0 21.61L5.67 20.12C7.23 20.97 8.99 21.42 10.79 21.42C16.68 21.42 21.49 16.62 21.49 10.71C21.49 7.85 20.38 5.16 18.36 3.14L18.37 3.14ZM10.8 19.61C9.2 19.61 7.63 19.18 6.27 18.37L5.95 18.18L2.58 19.06L3.48 15.78L3.27 15.44C2.38 14.02 1.91 12.39 1.91 10.7C1.91 5.8 5.9 1.81 10.81 1.81C13.19 1.81 15.42 2.73 17.1 4.41C18.79 6.1 19.71 8.33 19.71 10.71C19.71 15.62 15.71 19.62 10.81 19.62L10.8 19.61ZM15.68 12.94C15.41 12.81 14.1 12.16 13.85 12.08C13.6 11.99 13.43 11.94 13.25 12.21C13.07 12.47 12.56 13.08 12.4 13.26C12.24 13.44 12.08 13.46 11.82 13.32C11.55 13.19 10.69 12.91 9.66 11.99C8.87 11.28 8.33 10.41 8.18 10.14C8.02 9.87 8.18 9.74 8.29 9.59C8.59 9.24 8.87 8.86 8.96 8.68C9.05 8.5 9.01 8.34 8.94 8.21C8.88 8.07 8.34 6.75 8.12 6.22C7.9 5.7 7.68 5.77 7.52 5.76C7.36 5.75 7.18 5.75 7 5.75C6.83 5.75 6.53 5.82 6.29 6.08C6.05 6.35 5.36 7 5.36 8.31C5.36 9.63 6.31 10.9 6.45 11.08C6.59 11.26 8.34 13.96 11.02 15.12C11.66 15.4 12.16 15.56 12.55 15.69C13.18 15.89 13.77 15.86 14.23 15.79C14.74 15.72 15.81 15.14 16.03 14.52C16.26 13.9 16.26 13.36 16.19 13.25C16.12 13.13 15.94 13.07 15.68 12.93L15.68 12.94Z"
                  fill="#FFFFFF" fill-opacity="1.000000" fill-rule="evenodd" />
              </g>
            </svg>

          </a>
        </div>
      </div>
    </div>
  </section>

  <div class="wrapper-brown">
    <section class="quality-pasting">
      <div class="container">
        <h2 class="quality-pasting__title _title">
          Убедиться в качестве оклейки вы<br>
          сможете любым удобным для вас способом
        </h2>
        <div class="quality-pasting__items">
          <div class="quality-pasting__item">
            <div class="quality-pasting__item-wrapper">
              <img class="quality-pasting__item-img _img" src="<?php echo get_template_directory_uri(); ?>/assets/images/sec-09/excurs.webp" alt="">
            </div>
            <div class="quality-pasting__item-info">
              <h4 class="quality-pasting__item-title">
                Проведем экскурсию<br>
                по детейлинг-студии
              </h4>
              <p class="quality-pasting__item-text">
                Приглашаем вас посетить нашу<br> студию, где вы сможете увидеть <br>автомобили, находящиеся в работе,<br>
                и ознакомиться с процессом<br> разборки и сборки
              </p>
              <address class="footer__col-address quality-pasting__item-address">
                <?php include(get_template_directory() . '/assets/images/icons/geo.svg'); ?>
                <p>ул. Архитектора Щусева, 5, к1</p>
              </address>
              <a class="quality-pasting__item-btn _main-btn change-popup" href="#callback-modal" data-fancybox>
                Записаться на экскурсию<br>
                по детелинг-студии
              </a>
            </div>
          </div>
          <div class="quality-pasting__item">
            <div class="quality-pasting__item-info">
              <h4 class="quality-pasting__item-title">
                Предоставим видеоотчеты<br>
                выполненных оклеек,
              </h4>
              <p class="quality-pasting__item-text">
                в которых вы увидите все этапы —<br>
                от процесса разборки до оклейки<br>
                и сборки автомобиля
              </p>
              <a class="quality-pasting__item-btn _main-btn change-popup" href="#callback-modal" data-fancybox>
                Получить видеоотчеты<br>
                выполненных оклеек
              </a>
            </div>
            <div class="quality-pasting__item-wrapper">
              <img class="quality-pasting__item-img _img" src="<?php echo get_template_directory_uri(); ?>/assets/images/sec-09/report.webp" alt="">
            </div>
          </div>
          <div class="quality-pasting__item">
            <div class="quality-pasting__item-wrapper">
              <img class="quality-pasting__item-img _img" src="<?php echo get_template_directory_uri(); ?>/assets/images/sec-09/translation.webp" alt="">
            </div>
            <div class="quality-pasting__item-info">
              <h4 class="quality-pasting__item-title">
                Организуем онлайн- <br>
                трансляцию из студии<br>
                из детейлинга
              </h4>
              <p class="quality-pasting__item-text">
                Специалист выйдет с вами<br>
                на видеосвязь прямо из студии <br>детейлинга и покажет любой <br>интересующий процесс
              </p>
              <a class="quality-pasting__item-btn _main-btn change-popup" href="#callback-modal" data-fancybox>
                Согласовать время<br>
                видеосозвона
              </a>
            </div>
          </div>
        </div>
      </div>
    </section>
    <div class="space-sec"></div>
  </div>
  <?php get_template_part('template-parts/sections/sec-14'); ?>
  <?php get_template_part('template-parts/sections/map'); ?>
</main>

<?php get_footer(); ?>